MikroElektronika/core_packages/PIC/XC8/def/PIC18F45K40/mcu.h
// Register: IPR4
#define IPR4 IPR4
extern volatile unsigned char           IPR4                __at(0xEBE);
#ifndef _LIB_BUILD
asm("IPR4 equ 0EBEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1IP                 :1;
        unsigned TMR2IP                 :1;
        unsigned TMR3IP                 :1;
        unsigned TMR4IP                 :1;
        unsigned TMR5IP                 :1;
        unsigned TMR6IP                 :1;
    };
    struct {
        unsigned CCIP3IP                :1;
    };
} IPR4bits_t;
extern volatile IPR4bits_t IPR4bits __at(0xEBE);
// bitfield macros
#define _IPR4_TMR1IP_POSN                                   0x0
#define _IPR4_TMR1IP_POSITION                               0x0
#define _IPR4_TMR1IP_SIZE                                   0x1
#define _IPR4_TMR1IP_LENGTH                                 0x1
#define _IPR4_TMR1IP_MASK                                   0x1
#define _IPR4_TMR2IP_POSN                                   0x1
#define _IPR4_TMR2IP_POSITION                               0x1
#define _IPR4_TMR2IP_SIZE                                   0x1
#define _IPR4_TMR2IP_LENGTH                                 0x1
#define _IPR4_TMR2IP_MASK                                   0x2
#define _IPR4_TMR3IP_POSN                                   0x2
#define _IPR4_TMR3IP_POSITION                               0x2
#define _IPR4_TMR3IP_SIZE                                   0x1
#define _IPR4_TMR3IP_LENGTH                                 0x1
#define _IPR4_TMR3IP_MASK                                   0x4
#define _IPR4_TMR4IP_POSN                                   0x3
#define _IPR4_TMR4IP_POSITION                               0x3
#define _IPR4_TMR4IP_SIZE                                   0x1
#define _IPR4_TMR4IP_LENGTH                                 0x1
#define _IPR4_TMR4IP_MASK                                   0x8
#define _IPR4_TMR5IP_POSN                                   0x4
#define _IPR4_TMR5IP_POSITION                               0x4
#define _IPR4_TMR5IP_SIZE                                   0x1
#define _IPR4_TMR5IP_LENGTH                                 0x1
#define _IPR4_TMR5IP_MASK                                   0x10
#define _IPR4_TMR6IP_POSN                                   0x5
#define _IPR4_TMR6IP_POSITION                               0x5
#define _IPR4_TMR6IP_SIZE                                   0x1
#define _IPR4_TMR6IP_LENGTH                                 0x1
#define _IPR4_TMR6IP_MASK                                   0x20
#define _IPR4_CCIP3IP_POSN                                  0x0
#define _IPR4_CCIP3IP_POSITION                              0x0
#define _IPR4_CCIP3IP_SIZE                                  0x1
#define _IPR4_CCIP3IP_LENGTH                                0x1
#define _IPR4_CCIP3IP_MASK                                  0x1

// Register: IPR5
#define IPR5 IPR5
extern volatile unsigned char           IPR5                __at(0xEBF);
#ifndef _LIB_BUILD
asm("IPR5 equ 0EBFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1GIP                :1;
        unsigned TMR3GIP                :1;
        unsigned TMR5GIP                :1;
    };
    struct {
        unsigned CCH05                  :1;
        unsigned CCH15                  :1;
    };
} IPR5bits_t;
extern volatile IPR5bits_t IPR5bits __at(0xEBF);
// bitfield macros
#define _IPR5_TMR1GIP_POSN                                  0x0
#define _IPR5_TMR1GIP_POSITION                              0x0
#define _IPR5_TMR1GIP_SIZE                                  0x1
#define _IPR5_TMR1GIP_LENGTH                                0x1
#define _IPR5_TMR1GIP_MASK                                  0x1
#define _IPR5_TMR3GIP_POSN                                  0x1
#define _IPR5_TMR3GIP_POSITION                              0x1
#define _IPR5_TMR3GIP_SIZE                                  0x1
#define _IPR5_TMR3GIP_LENGTH                                0x1
#define _IPR5_TMR3GIP_MASK                                  0x2
#define _IPR5_TMR5GIP_POSN                                  0x2
#define _IPR5_TMR5GIP_POSITION                              0x2
#define _IPR5_TMR5GIP_SIZE                                  0x1
#define _IPR5_TMR5GIP_LENGTH                                0x1
#define _IPR5_TMR5GIP_MASK                                  0x4
#define _IPR5_CCH05_POSN                                    0x0
#define _IPR5_CCH05_POSITION                                0x0
#define _IPR5_CCH05_SIZE                                    0x1
#define _IPR5_CCH05_LENGTH                                  0x1
#define _IPR5_CCH05_MASK                                    0x1
#define _IPR5_CCH15_POSN                                    0x1
#define _IPR5_CCH15_POSITION                                0x1
#define _IPR5_CCH15_SIZE                                    0x1
#define _IPR5_CCH15_LENGTH                                  0x1
#define _IPR5_CCH15_MASK                                    0x2

// Register: IPR6
#define IPR6 IPR6
extern volatile unsigned char           IPR6                __at(0xEC0);
#ifndef _LIB_BUILD
asm("IPR6 equ 0EC0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1IP                 :1;
        unsigned CCP2IP                 :1;
    };
} IPR6bits_t;
extern volatile IPR6bits_t IPR6bits __at(0xEC0);
// bitfield macros
#define _IPR6_CCP1IP_POSN                                   0x0
#define _IPR6_CCP1IP_POSITION                               0x0
#define _IPR6_CCP1IP_SIZE                                   0x1
#define _IPR6_CCP1IP_LENGTH                                 0x1
#define _IPR6_CCP1IP_MASK                                   0x1
#define _IPR6_CCP2IP_POSN                                   0x1
#define _IPR6_CCP2IP_POSITION                               0x1
#define _IPR6_CCP2IP_SIZE                                   0x1
#define _IPR6_CCP2IP_LENGTH                                 0x1
#define _IPR6_CCP2IP_MASK                                   0x2

// Register: IPR7
#define IPR7 IPR7
extern volatile unsigned char           IPR7                __at(0xEC1);
#ifndef _LIB_BUILD
asm("IPR7 equ 0EC1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CWGIP                  :1;
        unsigned                        :4;
        unsigned NVMIP                  :1;
        unsigned CRCIP                  :1;
        unsigned SCANIP                 :1;
    };
    struct {
        unsigned CWG1IP                 :1;
    };
} IPR7bits_t;
extern volatile IPR7bits_t IPR7bits __at(0xEC1);
// bitfield macros
#define _IPR7_CWGIP_POSN                                    0x0
#define _IPR7_CWGIP_POSITION                                0x0
#define _IPR7_CWGIP_SIZE                                    0x1
#define _IPR7_CWGIP_LENGTH                                  0x1
#define _IPR7_CWGIP_MASK                                    0x1
#define _IPR7_NVMIP_POSN                                    0x5
#define _IPR7_NVMIP_POSITION                                0x5
#define _IPR7_NVMIP_SIZE                                    0x1
#define _IPR7_NVMIP_LENGTH                                  0x1
#define _IPR7_NVMIP_MASK                                    0x20
#define _IPR7_CRCIP_POSN                                    0x6
#define _IPR7_CRCIP_POSITION                                0x6
#define _IPR7_CRCIP_SIZE                                    0x1
#define _IPR7_CRCIP_LENGTH                                  0x1
#define _IPR7_CRCIP_MASK                                    0x40
#define _IPR7_SCANIP_POSN                                   0x7
#define _IPR7_SCANIP_POSITION                               0x7
#define _IPR7_SCANIP_SIZE                                   0x1
#define _IPR7_SCANIP_LENGTH                                 0x1
#define _IPR7_SCANIP_MASK                                   0x80
#define _IPR7_CWG1IP_POSN                                   0x0
#define _IPR7_CWG1IP_POSITION                               0x0
#define _IPR7_CWG1IP_SIZE                                   0x1
#define _IPR7_CWG1IP_LENGTH                                 0x1
#define _IPR7_CWG1IP_MASK                                   0x1

// Register: PIE0
#define PIE0 PIE0
extern volatile unsigned char           PIE0                __at(0xEC2);
#ifndef _LIB_BUILD
asm("PIE0 equ 0EC2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0IE                 :1;
        unsigned INT1IE                 :1;
        unsigned INT2IE                 :1;
        unsigned                        :1;
        unsigned IOCIE                  :1;
        unsigned TMR0IE                 :1;
    };
} PIE0bits_t;
extern volatile PIE0bits_t PIE0bits __at(0xEC2);
// bitfield macros
#define _PIE0_INT0IE_POSN                                   0x0
#define _PIE0_INT0IE_POSITION                               0x0
#define _PIE0_INT0IE_SIZE                                   0x1
#define _PIE0_INT0IE_LENGTH                                 0x1
#define _PIE0_INT0IE_MASK                                   0x1
#define _PIE0_INT1IE_POSN                                   0x1
#define _PIE0_INT1IE_POSITION                               0x1
#define _PIE0_INT1IE_SIZE                                   0x1
#define _PIE0_INT1IE_LENGTH                                 0x1
#define _PIE0_INT1IE_MASK                                   0x2
#define _PIE0_INT2IE_POSN                                   0x2
#define _PIE0_INT2IE_POSITION                               0x2
#define _PIE0_INT2IE_SIZE                                   0x1
#define _PIE0_INT2IE_LENGTH                                 0x1
#define _PIE0_INT2IE_MASK                                   0x4
#define _PIE0_IOCIE_POSN                                    0x4
#define _PIE0_IOCIE_POSITION                                0x4
#define _PIE0_IOCIE_SIZE                                    0x1
#define _PIE0_IOCIE_LENGTH                                  0x1
#define _PIE0_IOCIE_MASK                                    0x10
#define _PIE0_TMR0IE_POSN                                   0x5
#define _PIE0_TMR0IE_POSITION                               0x5
#define _PIE0_TMR0IE_SIZE                                   0x1
#define _PIE0_TMR0IE_LENGTH                                 0x1
#define _PIE0_TMR0IE_MASK                                   0x20

// Register: PIE1
#define PIE1 PIE1
extern volatile unsigned char           PIE1                __at(0xEC3);
#ifndef _LIB_BUILD
asm("PIE1 equ 0EC3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADIE                   :1;
        unsigned ADTIE                  :1;
        unsigned                        :4;
        unsigned CSWIE                  :1;
        unsigned OSCFIE                 :1;
    };
    struct {
        unsigned                        :7;
        unsigned PSPIE                  :1;
    };
} PIE1bits_t;
extern volatile PIE1bits_t PIE1bits __at(0xEC3);
// bitfield macros
#define _PIE1_ADIE_POSN                                     0x0
#define _PIE1_ADIE_POSITION                                 0x0
#define _PIE1_ADIE_SIZE                                     0x1
#define _PIE1_ADIE_LENGTH                                   0x1
#define _PIE1_ADIE_MASK                                     0x1
#define _PIE1_ADTIE_POSN                                    0x1
#define _PIE1_ADTIE_POSITION                                0x1
#define _PIE1_ADTIE_SIZE                                    0x1
#define _PIE1_ADTIE_LENGTH                                  0x1
#define _PIE1_ADTIE_MASK                                    0x2
#define _PIE1_CSWIE_POSN                                    0x6
#define _PIE1_CSWIE_POSITION                                0x6
#define _PIE1_CSWIE_SIZE                                    0x1
#define _PIE1_CSWIE_LENGTH                                  0x1
#define _PIE1_CSWIE_MASK                                    0x40
#define _PIE1_OSCFIE_POSN                                   0x7
#define _PIE1_OSCFIE_POSITION                               0x7
#define _PIE1_OSCFIE_SIZE                                   0x1
#define _PIE1_OSCFIE_LENGTH                                 0x1
#define _PIE1_OSCFIE_MASK                                   0x80
#define _PIE1_PSPIE_POSN                                    0x7
#define _PIE1_PSPIE_POSITION                                0x7
#define _PIE1_PSPIE_SIZE                                    0x1
#define _PIE1_PSPIE_LENGTH                                  0x1
#define _PIE1_PSPIE_MASK                                    0x80

// Register: PIE2
#define PIE2 PIE2
extern volatile unsigned char           PIE2                __at(0xEC4);
#ifndef _LIB_BUILD
asm("PIE2 equ 0EC4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C1IE                   :1;
        unsigned C2IE                   :1;
        unsigned                        :4;
        unsigned ZCDIE                  :1;
        unsigned HLVDIE                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned CMIE                   :1;
    };
} PIE2bits_t;
extern volatile PIE2bits_t PIE2bits __at(0xEC4);
// bitfield macros
#define _PIE2_C1IE_POSN                                     0x0
#define _PIE2_C1IE_POSITION                                 0x0
#define _PIE2_C1IE_SIZE                                     0x1
#define _PIE2_C1IE_LENGTH                                   0x1
#define _PIE2_C1IE_MASK                                     0x1
#define _PIE2_C2IE_POSN                                     0x1
#define _PIE2_C2IE_POSITION                                 0x1
#define _PIE2_C2IE_SIZE                                     0x1
#define _PIE2_C2IE_LENGTH                                   0x1
#define _PIE2_C2IE_MASK                                     0x2
#define _PIE2_ZCDIE_POSN                                    0x6
#define _PIE2_ZCDIE_POSITION                                0x6
#define _PIE2_ZCDIE_SIZE                                    0x1
#define _PIE2_ZCDIE_LENGTH                                  0x1
#define _PIE2_ZCDIE_MASK                                    0x40
#define _PIE2_HLVDIE_POSN                                   0x7
#define _PIE2_HLVDIE_POSITION                               0x7
#define _PIE2_HLVDIE_SIZE                                   0x1
#define _PIE2_HLVDIE_LENGTH                                 0x1
#define _PIE2_HLVDIE_MASK                                   0x80
#define _PIE2_CMIE_POSN                                     0x6
#define _PIE2_CMIE_POSITION                                 0x6
#define _PIE2_CMIE_SIZE                                     0x1
#define _PIE2_CMIE_LENGTH                                   0x1
#define _PIE2_CMIE_MASK                                     0x40

// Register: PIE3
#define PIE3 PIE3
extern volatile unsigned char           PIE3                __at(0xEC5);
#ifndef _LIB_BUILD
asm("PIE3 equ 0EC5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP1IE                 :1;
        unsigned BCL1IE                 :1;
        unsigned SSP2IE                 :1;
        unsigned BCL2IE                 :1;
        unsigned TX1IE                  :1;
        unsigned RC1IE                  :1;
        unsigned TX2IE                  :1;
        unsigned RC2IE                  :1;
    };
    struct {
        unsigned RXB0IE                 :1;
        unsigned RXB1IE                 :1;
        unsigned TXB0IE                 :1;
        unsigned TXB1IE                 :1;
        unsigned TXB2IE                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned RXBNIE                 :1;
        unsigned                        :2;
        unsigned TXBNIE                 :1;
    };
} PIE3bits_t;
